## Plan Result (prod-cftapps_cluster_lb)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 3 to add, 0 to change, 3 to destroy.</code></pre>

* Replace
  * module.cftapps-frontend-cluster-lb.azurerm_application_gateway.ag[0]
  * module.cftapps-frontend-cluster-lb.azurerm_monitor_diagnostic_setting.diagnostic_settings[0]
  * module.cftapps-frontend-cluster-lb.azurerm_public_ip.app_gw[0]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.cftapps-frontend-cluster-lb.data.azurerm_monitor_diagnostic_categories.diagnostic_categories[0] will be read during apply
  # (config refers to values not yet known)
 <= data "azurerm_monitor_diagnostic_categories" "diagnostic_categories" {
      + id          = (known after apply)
      + logs        = (known after apply)
      + metrics     = (known after apply)
      + resource_id = (known after apply)

      + timeouts {
          + read = (known after apply)
        }
    }

  # module.cftapps-frontend-cluster-lb.azurerm_application_gateway.ag[0] must be replaced
-/+ resource "azurerm_application_gateway" "ag" {
      - enable_http2        = false -> null
      ~ id                  = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/aks-infra-prod-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-prod-agw" -> (known after apply)
        name                = "aks-fe-00-prod-agw"
      ~ resource_group_name = "aks-infra-prod-rg" -> "cft-prod-network-rg" # forces replacement
        tags                = {
            "application"  = "core"
            "builtFrom"    = "hmcts/azure-platform-terraform"
            "businessArea" = "CFT"
            "criticality"  = "High"
            "environment"  = "production"
        }
        # (2 unchanged attributes hidden)


      ~ backend_address_pool {
          - fqdns        = [] -> null
          ~ id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/aks-infra-prod-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-prod-agw/backendAddressPools/plum" -> (known after apply)
          ~ ip_addresses = [
              - "10.13.15.250",
              - "10.13.31.250",
              + "10.90.95.250",
            ]
            name         = "plum"
        }
      ~ backend_address_pool {
          - fqdns        = [] -> null
          ~ id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/aks-infra-prod-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-prod-agw/backendAddressPools/div-dn" -> (known after apply)
          ~ ip_addresses = [
              - "10.13.15.250",
              - "10.13.31.250",
              + "10.90.95.250",
            ]
            name         = "div-dn"
        }
      ~ backend_address_pool {
          - fqdns        = [] -> null
          ~ id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/aks-infra-prod-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-prod-agw/backendAddressPools/div-da" -> (known after apply)
          ~ ip_addresses = [
              - "10.13.15.250",
              - "10.13.31.250",
              + "10.90.95.250",
            ]
            name         = "div-da"
        }
      ~ backend_address_pool {
          - fqdns        = [] -> null
          ~ id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/aks-infra-prod-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-prod-agw/backendAddressPools/div-rfe" -> (known after apply)
          ~ ip_addresses = [
              - "10.13.15.250",
              - "10.13.31.250",
              + "10.90.95.250",
            ]
            name         = "div-rfe"
        }
      ~ backend_address_pool {
          - fqdns        = [] -> null
          ~ id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/aks-infra-prod-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-prod-agw/backendAddressPools/div-pfe" -> (known after apply)
          ~ ip_addresses = [
              - "10.13.15.250",
              - "10.13.31.250",
              + "10.90.95.250",
            ]
            name         = "div-pfe"
        }
      ~ backend_address_pool {
          - fqdns        = [] -> null
          ~ id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/aks-infra-prod-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-prod-agw/backendAddressPools/div-amend" -> (known after apply)
          ~ ip_addresses = [
              - "10.13.15.250",
              - "10.13.31.250",
              + "10.90.95.250",
            ]
            name         = "div-amend"
        }
      ~ backend_address_pool {
          - fqdns        = [] -> null
          ~ id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/aks-infra-prod-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-prod-agw/backendAddressPools/nfdiv-civil-partnership" -> (known after apply)
          ~ ip_addresses = [
              - "10.13.15.250",
              - "10.13.31.250",
              + "10.90.95.250",
            ]
            name         = "nfdiv-civil-partnership"
        }
      ~ backend_address_pool {
          - fqdns        = [] -> null
          ~ id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/aks-infra-prod-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-prod-agw/backendAddressPools/sscs-tribunals" -> (known after apply)
          ~ ip_addresses = [
              - "10.13.15.250",
              - "10.13.31.250",
              + "10.90.95.250",
            ]
            name         = "sscs-tribunals"
        }
      ~ backend_address_pool {
          - fqdns        = [] -> null
          ~ id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/aks-infra-prod-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-prod-agw/backendAddressPools/sscs-tya" -> (known after apply)
          ~ ip_addresses = [
              - "10.13.15.250",
              - "10.13.31.250",
              + "10.90.95.250",
            ]
            name         = "sscs-tya"
        }
      ~ backend_address_pool {
          - fqdns        = [] -> null
          ~ id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/aks-infra-prod-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-prod-agw/backendAddressPools/sscs-cor" -> (known after apply)
          ~ ip_addresses = [
              - "10.13.15.250",
              - "10.13.31.250",
              + "10.90.95.250",
            ]
            name         = "sscs-cor"
        }
      ~ backend_address_pool {
          - fqdns        = [] -> null
          ~ id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/aks-infra-prod-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-prod-agw/backendAddressPools/xui-webapp" -> (known after apply)
          ~ ip_addresses = [
              - "10.13.15.250",
              - "10.13.31.250",
              + "10.90.95.250",
            ]
            name         = "xui-webapp"
        }
      ~ backend_address_pool {
          - fqdns        = [] -> null
          ~ id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/aks-infra-prod-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-prod-agw/backendAddressPools/xui-manage-org" -> (known after apply)
          ~ ip_addresses = [
              - "10.13.15.250",
              - "10.13.31.250",
              + "10.90.95.250",
            ]
            name         = "xui-manage-org"
        }
      ~ backend_address_pool {
          - fqdns        = [] -> null
          ~ id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/aks-infra-prod-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-prod-agw/backendAddressPools/xui-approve-org" -> (known after apply)
          ~ ip_addresses = [
              - "10.13.15.250",
              - "10.13.31.250",
              + "10.90.95.250",
            ]
            name         = "xui-approve-org"
        }
      ~ backend_address_pool {
          - fqdns        = [] -> null
          ~ id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/aks-infra-prod-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-prod-agw/backendAddressPools/xui-register-org" -> (known after apply)
          ~ ip_addresses = [
              - "10.13.15.250",
              - "10.13.31.250",
              + "10.90.95.250",
            ]
            name         = "xui-register-org"
        }
      ~ backend_address_pool {
          - fqdns        = [] -> null
          ~ id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/aks-infra-prod-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-prod-agw/backendAddressPools/cmc" -> (known after apply)
          ~ ip_addresses = [
              - "10.13.15.250",
              - "10.13.31.250",
              + "10.90.95.250",
            ]
            name         = "cmc"
        }
      ~ backend_address_pool {
          - fqdns        = [] -> null
          ~ id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/aks-infra-prod-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-prod-agw/backendAddressPools/cmc-legal" -> (known after apply)
          ~ ip_addresses = [
              - "10.13.15.250",
              - "10.13.31.250",
              + "10.90.95.250",
            ]
            name         = "cmc-legal"
        }
      ~ backend_address_pool {
          - fqdns        = [] -> null
          ~ id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/aks-infra-prod-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-prod-agw/backendAddressPools/gateway-ccd" -> (known after apply)
          ~ ip_addresses = [
              - "10.13.15.250",
              - "10.13.31.250",
              + "10.90.95.250",
            ]
            name         = "gateway-ccd"
        }
      ~ backend_address_pool {
          - fqdns        = [] -> null
          ~ id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/aks-infra-prod-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-prod-agw/backendAddressPools/return-case-doc-ccd" -> (known after apply)
          ~ ip_addresses = [
              - "10.13.15.250",
              - "10.13.31.250",
              + "10.90.95.250",
            ]
            name         = "return-case-doc-ccd"
        }
      ~ backend_address_pool {
          - fqdns        = [] -> null
          ~ id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/aks-infra-prod-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-prod-agw/backendAddressPools/probate" -> (known after apply)
          ~ ip_addresses = [
              - "10.13.15.250",
              - "10.13.31.250",
              + "10.90.95.250",
            ]
            name         = "probate"
        }
      ~ backend_address_pool {
          - fqdns        = [] -> null
          ~ id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/aks-infra-prod-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-prod-agw/backendAddressPools/ia-aip" -> (known after apply)
          ~ ip_addresses = [
              - "10.13.15.250",
              - "10.13.31.250",
              + "10.90.95.250",
            ]
            name         = "ia-aip"
        }
      ~ backend_address_pool {
          - fqdns        = [] -> null
          ~ id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/aks-infra-prod-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-prod-agw/backendAddressPools/fees-register" -> (known after apply)
          ~ ip_addresses = [
              - "10.13.15.250",
              - "10.13.31.250",
              + "10.90.95.250",
            ]
            name         = "fees-register"
        }
      ~ backend_address_pool {
          - fqdns        = [] -> null
          ~ id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/aks-infra-prod-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-prod-agw/backendAddressPools/paybubble" -> (known after apply)
          ~ ip_addresses = [
              - "10.13.15.250",
              - "10.13.31.250",
              + "10.90.95.250",
            ]
            name         = "paybubble"
        }
      ~ backend_address_pool {
          - fqdns        = [] -> null
          ~ id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/aks-infra-prod-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-prod-agw/backendAddressPools/manage-payments" -> (known after apply)
          ~ ip_addresses = [
              - "10.13.15.250",
              - "10.13.31.250",
              + "10.90.95.250",
            ]
            name         = "manage-payments"
        }
      ~ backend_address_pool {
          - fqdns        = [] -> null
          ~ id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/aks-infra-prod-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-prod-agw/backendAddressPools/payment-outcome" -> (known after apply)
          ~ ip_addresses = [
              - "10.13.15.250",
              - "10.13.31.250",
              + "10.90.95.250",
            ]
            name         = "payment-outcome"
        }
      ~ backend_address_pool {
          - fqdns        = [] -> null
          ~ id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/aks-infra-prod-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-prod-agw/backendAddressPools/idam-web-public" -> (known after apply)
          ~ ip_addresses = [
              - "10.13.15.250",
              - "10.13.31.250",
              + "10.90.95.250",
            ]
            name         = "idam-web-public"
        }
      ~ backend_address_pool {
          - fqdns        = [] -> null
          ~ id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/aks-infra-prod-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-prod-agw/backendAddressPools/pcq" -> (known after apply)
          ~ ip_addresses = [
              - "10.13.15.250",
              - "10.13.31.250",
              + "10.90.95.250",
            ]
            name         = "pcq"
        }
      ~ backend_address_pool {
          - fqdns        = [] -> null
          ~ id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/aks-infra-prod-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-prod-agw/backendAddressPools/lau" -> (known after apply)
          ~ ip_addresses = [
              - "10.13.15.250",
              - "10.13.31.250",
              + "10.90.95.250",
            ]
            name         = "lau"
        }
      ~ backend_address_pool {
          - fqdns        = [] -> null
          ~ id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/aks-infra-prod-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-prod-agw/backendAddressPools/cft-api-mgmt" -> (known after apply)
          ~ ip_addresses = [
              - "10.13.15.250",
              - "10.13.31.250",
              + "10.90.95.250",
            ]
            name         = "cft-api-mgmt"
        }
      ~ backend_address_pool {
          - fqdns        = [] -> null
          ~ id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/aks-infra-prod-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-prod-agw/backendAddressPools/fact" -> (known after apply)
          ~ ip_addresses = [
              - "10.13.15.250",
              - "10.13.31.250",
              + "10.90.95.250",
            ]
            name         = "fact"
        }
      ~ backend_address_pool {
          - fqdns        = [] -> null
          ~ id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/aks-infra-prod-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-prod-agw/backendAddressPools/fact-admin" -> (known after apply)
          ~ ip_addresses = [
              - "10.13.15.250",
              - "10.13.31.250",
              + "10.90.95.250",
            ]
            name         = "fact-admin"
        }
      ~ backend_address_pool {
          - fqdns        = [] -> null
          ~ id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/aks-infra-prod-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-prod-agw/backendAddressPools/fact-redirect" -> (known after apply)
          ~ ip_addresses = [
              - "10.13.15.250",
              - "10.13.31.250",
              + "10.90.95.250",
            ]
            name         = "fact-redirect"
        }
      ~ backend_address_pool {
          - fqdns        = [] -> null
          ~ id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/aks-infra-prod-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-prod-agw/backendAddressPools/jui-redirect" -> (known after apply)
          ~ ip_addresses = [
              - "10.13.15.250",
              - "10.13.31.250",
              + "10.90.95.250",
            ]
            name         = "jui-redirect"
        }
      ~ backend_address_pool {
          - fqdns        = [] -> null
          ~ id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/aks-infra-prod-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-prod-agw/backendAddressPools/idam-web-admin" -> (known after apply)
          ~ ip_addresses = [
              - "10.13.15.250",
              - "10.13.31.250",
              + "10.90.95.250",
            ]
            name         = "idam-web-admin"
        }
      ~ backend_address_pool {
          - fqdns        = [] -> null
          ~ id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/aks-infra-prod-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-prod-agw/backendAddressPools/idam-user-dashboard" -> (known after apply)
          ~ ip_addresses = [
              - "10.13.15.250",
              - "10.13.31.250",
              + "10.90.95.250",
            ]
            name         = "idam-user-dashboard"
        }
      ~ backend_address_pool {
          - fqdns        = [] -> null
          ~ id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/aks-infra-prod-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-prod-agw/backendAddressPools/hmi-apim" -> (known after apply)
          ~ ip_addresses = [
              - "10.13.15.250",
              - "10.13.31.250",
              + "10.90.95.250",
            ]
            name         = "hmi-apim"
        }
      ~ backend_address_pool {
          - fqdns        = [] -> null
          ~ id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/aks-infra-prod-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-prod-agw/backendAddressPools/reformscan" -> (known after apply)
          ~ ip_addresses = [
              - "10.13.15.250",
              - "10.13.31.250",
              + "10.90.95.250",
            ]
            name         = "reformscan"
        }
      ~ backend_address_pool {
          - fqdns        = [] -> null
          ~ id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/aks-infra-prod-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-prod-agw/backendAddressPools/adoption" -> (known after apply)
          ~ ip_addresses = [
              - "10.13.15.250",
              - "10.13.31.250",
              + "10.90.95.250",
            ]
            name         = "adoption"
        }

      ~ backend_http_settings {
          ~ id                                  = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/aks-infra-prod-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-prod-agw/backendHttpSettingsCollection/plum" -> (known after apply)
            name                                = "plum"
          ~ probe_id                         

# ...
# ... The maximum length of GitHub Comment is 65536, so the content is omitted by tfcmt.
# ...

_rule_set_name      = "x_fwded_proto"
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "idam-web-admin"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "idam-web-admin"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "idam-web-admin"
          + id                         = (known after apply)
          + name                       = "idam-web-admin"
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rewrite_rule_set_name      = "x_fwded_proto"
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "idam-web-public"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "idam-web-public"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "idam-web-public"
          + id                         = (known after apply)
          + name                       = "idam-web-public"
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rewrite_rule_set_name      = "x_fwded_proto"
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "jui-redirect"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "jui-redirect"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "jui-redirect"
          + id                         = (known after apply)
          + name                       = "jui-redirect"
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rewrite_rule_set_name      = "x_fwded_proto"
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "lau"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "lau"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "lau"
          + id                         = (known after apply)
          + name                       = "lau"
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rewrite_rule_set_name      = "x_fwded_proto"
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "manage-payments"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "manage-payments"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "manage-payments"
          + id                         = (known after apply)
          + name                       = "manage-payments"
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rewrite_rule_set_name      = "x_fwded_proto"
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "nfdiv-civil-partnership"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "nfdiv-civil-partnership"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "nfdiv-civil-partnership"
          + id                         = (known after apply)
          + name                       = "nfdiv-civil-partnership"
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rewrite_rule_set_name      = "x_fwded_proto"
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "paybubble"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "paybubble"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "paybubble"
          + id                         = (known after apply)
          + name                       = "paybubble"
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rewrite_rule_set_name      = "x_fwded_proto"
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "payment-outcome"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "payment-outcome"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "payment-outcome"
          + id                         = (known after apply)
          + name                       = "payment-outcome"
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rewrite_rule_set_name      = "x_fwded_proto"
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "pcq"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "pcq"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "pcq"
          + id                         = (known after apply)
          + name                       = "pcq"
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rewrite_rule_set_name      = "x_fwded_proto"
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "plum"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "plum"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "plum"
          + id                         = (known after apply)
          + name                       = "plum"
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rewrite_rule_set_name      = "x_fwded_proto"
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "probate"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "probate"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "probate"
          + id                         = (known after apply)
          + name                       = "probate"
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rewrite_rule_set_name      = "x_fwded_proto"
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "reformscan"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "reformscan"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "reformscan"
          + id                         = (known after apply)
          + name                       = "reformscan"
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rewrite_rule_set_name      = "x_fwded_proto"
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "return-case-doc-ccd"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "return-case-doc-ccd"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "return-case-doc-ccd"
          + id                         = (known after apply)
          + name                       = "return-case-doc-ccd"
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rewrite_rule_set_name      = "x_fwded_proto"
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "sscs-cor"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "sscs-cor"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "sscs-cor"
          + id                         = (known after apply)
          + name                       = "sscs-cor"
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rewrite_rule_set_name      = "x_fwded_proto"
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "sscs-tribunals"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "sscs-tribunals"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "sscs-tribunals"
          + id                         = (known after apply)
          + name                       = "sscs-tribunals"
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rewrite_rule_set_name      = "x_fwded_proto"
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "sscs-tya"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "sscs-tya"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "sscs-tya"
          + id                         = (known after apply)
          + name                       = "sscs-tya"
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rewrite_rule_set_name      = "x_fwded_proto"
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "xui-approve-org"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "xui-approve-org"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "xui-approve-org"
          + id                         = (known after apply)
          + name                       = "xui-approve-org"
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rewrite_rule_set_name      = "x_fwded_proto"
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "xui-manage-org"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "xui-manage-org"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "xui-manage-org"
          + id                         = (known after apply)
          + name                       = "xui-manage-org"
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rewrite_rule_set_name      = "x_fwded_proto"
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "xui-register-org"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "xui-register-org"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "xui-register-org"
          + id                         = (known after apply)
          + name                       = "xui-register-org"
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rewrite_rule_set_name      = "x_fwded_proto"
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "xui-webapp"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "xui-webapp"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "xui-webapp"
          + id                         = (known after apply)
          + name                       = "xui-webapp"
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rewrite_rule_set_name      = "x_fwded_proto"
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }

      ~ rewrite_rule_set {
          ~ id   = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/aks-infra-prod-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-prod-agw/rewriteRuleSets/x_fwded_proto" -> (known after apply)
            name = "x_fwded_proto"

            # (1 unchanged block hidden)
        }

      ~ sku {
          - capacity = 0 -> null
            name     = "Standard_v2"
            # (1 unchanged attribute hidden)
        }

      ~ ssl_policy {
          ~ cipher_suites        = [] -> (known after apply)
          ~ disabled_protocols   = [] -> (known after apply)
          + min_protocol_version = (known after apply)
          ~ policy_name          = "AppGwSslPolicy20150501" -> (known after apply)
          ~ policy_type          = "Predefined" -> (known after apply)
        }
        # (1 unchanged block hidden)
    }

  # module.cftapps-frontend-cluster-lb.azurerm_monitor_diagnostic_setting.diagnostic_settings[0] must be replaced
-/+ resource "azurerm_monitor_diagnostic_setting" "diagnostic_settings" {
      ~ id                         = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/aks-infra-prod-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-prod-agw|AppGw" -> (known after apply)
        name                       = "AppGw"
      ~ target_resource_id         = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/aks-infra-prod-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-prod-agw" -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)

      - log {
          - category = "ApplicationGatewayAccessLog" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
      - log {
          - category = "ApplicationGatewayFirewallLog" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
      - log {
          - category = "ApplicationGatewayPerformanceLog" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = true -> null
            }
        }
      + metric {
          + category = (known after apply)
          + enabled  = (known after apply)

          + retention_policy {
              + days    = (known after apply)
              + enabled = (known after apply)
            }
        }
    }

  # module.cftapps-frontend-cluster-lb.azurerm_public_ip.app_gw[0] must be replaced
-/+ resource "azurerm_public_ip" "app_gw" {
      + fqdn                    = (known after apply)
      ~ id                      = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/aks-infra-prod-rg/providers/Microsoft.Network/publicIPAddresses/aks-fe-appgw-prod-pip" -> (known after apply)
      ~ ip_address              = "51.11.44.165" -> (known after apply)
      - ip_tags                 = {} -> null
        name                    = "aks-fe-appgw-prod-pip"
      ~ resource_group_name     = "aks-infra-prod-rg" -> "cft-prod-network-rg" # forces replacement
        tags                    = {
            "application"  = "core"
            "builtFrom"    = "hmcts/azure-platform-terraform"
            "businessArea" = "CFT"
            "criticality"  = "High"
            "environment"  = "production"
        }
      - zones                   = [] -> null
        # (5 unchanged attributes hidden)
    }

Plan: 3 to add, 0 to change, 3 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":1002,"Program":"tfcmt","SHA1":"","Target":"prod-cftapps_cluster_lb","Vars":{}} -->